errors = {
    "ERR_001": {
        "code": 1,
        "name": "ERR_001",
        "message": "Хэрэглэгчийн нууц үг эсвэл и-мэйл хаяг буруу байна.",
    },

    "ERR_002": {
        "code": 2,
        "name": "ERR_002",
        "message": "Алдаа гарлаа. Системийн админд хандана уу.",
    },

    "ERR_003": {
        "code": 3,
        "name": "ERR_003",
        "message": "Бүртгэгдсэн боловсролын зэрэг байна.",
    },

    "ERR_004": {
        "code": 4,
        "name": "ERR_004",
        "message": "Бүртгэгдсэн суралцах хэлбэр байна.",
    },

    "ERR_005": {
        "code": 5,
        "name": "ERR_005",
        "message": "Бүртгэгдсэн оюутны бүртгэл байна.",
    },

    "ERR_006": {
        "code": 6,
        "name": "ERR_006",
        "message": "Бүртгэгдсэн хичээлийн ангилал байна.",
    },

    "ERR_007": {
        "code": 7,
        "name": "ERR_007",
        "message": "Бүртгэгдсэн хичээлийн төрөл байна.",
    },

    "ERR_008": {
        "code": 8,
        "name": "ERR_008",
        "message": "Бүртгэгдсэн хичээлийн түвшин байна.",
    },

    "ERR_009": {
        "code": 9,
        "name": "ERR_009",
        "message": "Бүртгэгдсэн хичээлийн бүлэг байна.",
    },

    "ERR_010": {
        "code": 10,
        "name": "ERR_010",
        "message": "Бүртгэгдсэн улирал байна.",
    },

    "ERR_011": {
        "code": 11,
        "name": "ERR_011",
        "message": "Бүртгэгдсэн дүнгийн бүртгэл байна.",
    },



}
