import { utils, writeFile } from 'xlsx-js-style'

import { dataz } from './sampledata'

export function downloadGeneralReport(datas) {

    const header = Array.from({length: 2},(_, hidx) => {
        return(
            /**
             * Key давхцаж болохгүйг анхаарна уу.
             */
                {
                    'Бүрэлдэхүүн сургууль институт':'',
                    'Хөтөлбөр':'',
                    'Хяналтын тоо/Бүртгүүлсэн | эр':'',
                    'Хяналтын тоо/Бүртгүүлсэн | эм':'',
                    'Насны шаардлага хангасан | Тийм | Эр':'',
                    'Насны шаардлага хангасан | Тийм | Эм':'',
                    'Насны шаардлага хангасан | Үгүй | Эр':'',
                    'Насны шаардлага хангасан | Үгүй | Эм':'',
                    'Төгссөн мэргэжил шаардлага хангасан эсэх | Тийм | Эр':'',
                    'Төгссөн мэргэжил шаардлага хангасан эсэх | Тийм | Эм':'',
                    'Төгссөн мэргэжил шаардлага хангасан эсэх | Үгүй | Эр':'',
                    'Төгссөн мэргэжил шаардлага хангасан эсэх | Үгүй | Эм':'',
                    'Дипломын голч дүнгийн шаардлага хангасан эсэх | Тийм | Эр':'',
                    'Дипломын голч дүнгийн шаардлага хангасан эсэх | Тийм | Эм':'',
                    'Дипломын голч дүнгийн шаардлага хангасан эсэх | Үгүй | Эр':'',
                    'Дипломын голч дүнгийн шаардлага хангасан эсэх | Үгүй | Эм':'',
                    'Хяналтын тоо | Эр':'',
                    'Хяналтын тоо | Эм':'',
                    'Анхан шатны үзлэг | Тэнцсэн | Эр':'',
                    'Анхан шатны үзлэг | Тэнцсэн | Эм':'',
                    'Анхан шатны үзлэг | Тэнцээгүй | Эр':'',
                    'Анхан шатны үзлэг | Тэнцээгүй | Эм':'',
                    'Анхан шатны үзлэг | Үзлэгт ороогүй | Эр':'',
                    'Анхан шатны үзлэг | Үзлэгт ороогүй | Эм':'',
                    'Эрүүл мэндийн үзлэг шинжилгээний дүгнэлт | Тэнцсэн | Эр':'',
                    'Эрүүл мэндийн үзлэг шинжилгээний дүгнэлт | Тэнцсэн | Эм':'',
                    'Эрүүл мэндийн үзлэг шинжилгээний дүгнэлт | Тэнцээгүй | Эр':'',
                    'Эрүүл мэндийн үзлэг шинжилгээний дүгнэлт | Тэнцээгүй | Эм':'',
                    'Эрүүл мэндийн үзлэг шинжилгээний дүгнэлт | Үзлэгт ороогүй | Эр':'',
                    'Эрүүл мэндийн үзлэг шинжилгээний дүгнэлт | Үзлэгт ороогүй | Эм':'',
                    'Эрүүгийн хариуцлага хүлээж байсан эсэх шаардлага | Хангасан | Эр':'',
                    'Эрүүгийн хариуцлага хүлээж байсан эсэх шаардлага | Хангасан | Эм':'',
                    'Эрүүгийн хариуцлага хүлээж байсан эсэх шаардлага | Хангаагүй | Эр':'',
                    'Эрүүгийн хариуцлага хүлээж байсан эсэх шаардлага | Хангаагүй | Эм':'',
                    'Бие бялдрын шалгалт | Тэнцсэн | Эр':'',
                    'Бие бялдрын шалгалт | Тэнцсэн | Эм':'',
                    'Бие бялдрын шалгалт | Тэнцээгүй | Эр':'',
                    'Бие бялдрын шалгалт | Тэнцээгүй | Эм':'',
                    'Бие бялдрын шалгалт | Шалгалтад ороогүй | Эр':'',
                    'Бие бялдрын шалгалт | Шалгалтад ороогүй | Эм':'',
                    'Сэтгэл зүйн сорил, ярилцлага | Тэнцсэн | Эр':'',
                    'Сэтгэл зүйн сорил, ярилцлага | Тэнцсэн | Эм':'',
                    'Сэтгэл зүйн сорил, ярилцлага | Тэнцээгүй | Эр':'',
                    'Сэтгэл зүйн сорил, ярилцлага | Тэнцээгүй | Эм':'',
                    'Сэтгэл зүйн сорил, ярилцлага | Сорил, ярилцлагад ороогүй | Эр':'',
                    'Сэтгэл зүйн сорил, ярилцлага | Сорил, ярилцлагад ороогүй | Эм':'',
                    'Хувцасны хангалт авсан эсэх | Тийм | Эр':'',
                    'Хувцасны хангалт авсан эсэх | Тийм | Эм':'',
                    'Хувцасны хангалт авсан эсэх | Үгүй | Эр':'',
                    'Хувцасны хангалт авсан эсэх | Үгүй | Эм':'',
                    'Цэргийн хэргийн анхан шатны бэлтгэл сургалтад хамрагдсан эсэх | Тийм | Эр':'',
                    'Цэргийн хэргийн анхан шатны бэлтгэл сургалтад хамрагдсан эсэх | Тийм | Эм':'',
                    'Цэргийн хэргийн анхан шатны бэлтгэл сургалтад хамрагдсан эсэх | Үгүй | Эр':'',
                    'Цэргийн хэргийн анхан шатны бэлтгэл сургалтад хамрагдсан эсэх | Үгүй | Эм':'',
                    'Хяналтын тоо/элсүүлэн суралцуулах тушаалд орох | Эр':'',
                    'Хяналтын тоо/элсүүлэн суралцуулах тушаалд орох | Эм':'',
                }
            )
        }
    )

    // const flattenedArray = groupdata().flatMap(item => [
    //     ...item.map((ditem, didx) => ({ ...ditem })),
    // ]);

    // const mainData = flattenedArray.map((data, cidx) => {
    //     return(
    //         {
    //             ' ': '',
    //         }
    //     )}
    // )

    const mainData = datas.map((data) => {
        // const mainData = Array.from({length: 5},(_, hidx) => {
        return(
            /**
             * Key давхцаж болохгүйг анхаарна уу.
             */
                {
                    'Бүрэлдэхүүн сургууль институт':data?.suborg,
                    'Хөтөлбөр':data?.profession,
                    'Хяналтын тоо/Бүртгүүлсэн | эр':data?.total_male_users,
                    'Хяналтын тоо/Бүртгүүлсэн | эм':data?.total_female_users,
                    'Насны шаардлага хангасан | Тийм | Эр':data?.age_state_true_male,
                    'Насны шаардлага хангасан | Тийм | Эм':data?.age_state_true_female,
                    'Насны шаардлага хангасан | Үгүй | Эр':data?.age_state_false_male,
                    'Насны шаардлага хангасан | Үгүй | Эм':data?.age_state_false_female,
                    'Төгссөн мэргэжил шаардлага хангасан эсэх | Тийм | Эр':'',
                    'Төгссөн мэргэжил шаардлага хангасан эсэх | Тийм | Эм':'',
                    'Төгссөн мэргэжил шаардлага хангасан эсэх | Үгүй | Эр':'',
                    'Төгссөн мэргэжил шаардлага хангасан эсэх | Үгүй | Эм':'',
                    'Дипломын голч дүнгийн шаардлага хангасан эсэх | Тийм | Эр':data?.gpa_state_true_male,
                    'Дипломын голч дүнгийн шаардлага хангасан эсэх | Тийм | Эм':data?.gpa_state_true_female,
                    'Дипломын голч дүнгийн шаардлага хангасан эсэх | Үгүй | Эр':data?.gpa_state_false_male,
                    'Дипломын голч дүнгийн шаардлага хангасан эсэх | Үгүй | Эм':data?.gpa_state_false_female,
                    'Хяналтын тоо | Эр':'',
                    'Хяналтын тоо | Эм':'',
                    'Анхан шатны үзлэг | Тэнцсэн | Эр':data?.health_user_true_male_users,
                    'Анхан шатны үзлэг | Тэнцсэн | Эм':data?.health_user_true_female_users,
                    'Анхан шатны үзлэг | Тэнцээгүй | Эр':data?.health_user_false_male_users,
                    'Анхан шатны үзлэг | Тэнцээгүй | Эм':data?.health_user_false_female_users,
                    'Анхан шатны үзлэг | Үзлэгт ороогүй | Эр':data?.health_user_send_male_users,
                    'Анхан шатны үзлэг | Үзлэгт ороогүй | Эм':data?.health_user_send_female_users,
                    'Эрүүл мэндийн үзлэг шинжилгээний дүгнэлт | Тэнцсэн | Эр':data?.health_up_user_true_male_users,
                    'Эрүүл мэндийн үзлэг шинжилгээний дүгнэлт | Тэнцсэн | Эм':data?.health_up_user_true_female_users,
                    'Эрүүл мэндийн үзлэг шинжилгээний дүгнэлт | Тэнцээгүй | Эр':data?.health_up_user_false_male_users,
                    'Эрүүл мэндийн үзлэг шинжилгээний дүгнэлт | Тэнцээгүй | Эм':data?.health_up_user_false_female_users,
                    'Эрүүл мэндийн үзлэг шинжилгээний дүгнэлт | Үзлэгт ороогүй | Эр':data?.health_up_user_out_male_users,
                    'Эрүүл мэндийн үзлэг шинжилгээний дүгнэлт | Үзлэгт ороогүй | Эм':data?.health_up_user_out_female_users,
                    'Эрүүгийн хариуцлага хүлээж байсан эсэх шаардлага | Хангасан | Эр':data?.justice_state_true_male,
                    'Эрүүгийн хариуцлага хүлээж байсан эсэх шаардлага | Хангасан | Эм':data?.justice_state_true_female,
                    'Эрүүгийн хариуцлага хүлээж байсан эсэх шаардлага | Хангаагүй | Эр':data?.justice_state_false_male,
                    'Эрүүгийн хариуцлага хүлээж байсан эсэх шаардлага | Хангаагүй | Эм':data?.justice_state_false_female,
                    'Бие бялдрын шалгалт | Тэнцсэн | Эр':data?.physque_state_true_male,
                    'Бие бялдрын шалгалт | Тэнцсэн | Эм':data?.physque_state_true_female,
                    'Бие бялдрын шалгалт | Тэнцээгүй | Эр':data?.physque_state_false_male,
                    'Бие бялдрын шалгалт | Тэнцээгүй | Эм':data?.physque_state_false_female,
                    'Бие бялдрын шалгалт | Шалгалтад ороогүй | Эр':data?.physque_state_out_male,
                    'Бие бялдрын шалгалт | Шалгалтад ороогүй | Эм':data?.physque_state_out_female,
                    'Сэтгэл зүйн сорил, ярилцлага | Тэнцсэн | Эр':'',
                    'Сэтгэл зүйн сорил, ярилцлага | Тэнцсэн | Эм':'',
                    'Сэтгэл зүйн сорил, ярилцлага | Тэнцээгүй | Эр':'',
                    'Сэтгэл зүйн сорил, ярилцлага | Тэнцээгүй | Эм':'',
                    'Сэтгэл зүйн сорил, ярилцлага | Сорил, ярилцлагад ороогүй | Эр':'',
                    'Сэтгэл зүйн сорил, ярилцлага | Сорил, ярилцлагад ороогүй | Эм':'',
                    'Хувцасны хангалт авсан эсэх | Тийм | Эр':'',
                    'Хувцасны хангалт авсан эсэх | Тийм | Эм':'',
                    'Хувцасны хангалт авсан эсэх | Үгүй | Эр':'',
                    'Хувцасны хангалт авсан эсэх | Үгүй | Эм':'',
                    'Цэргийн хэргийн анхан шатны бэлтгэл сургалтад хамрагдсан эсэх | Тийм | Эр':'',
                    'Цэргийн хэргийн анхан шатны бэлтгэл сургалтад хамрагдсан эсэх | Тийм | Эм':'',
                    'Цэргийн хэргийн анхан шатны бэлтгэл сургалтад хамрагдсан эсэх | Үгүй | Эр':'',
                    'Цэргийн хэргийн анхан шатны бэлтгэл сургалтад хамрагдсан эсэх | Үгүй | Эм':'',
                    'Хяналтын тоо/элсүүлэн суралцуулах тушаалд орох | Эр':'',
                    'Хяналтын тоо/элсүүлэн суралцуулах тушаалд орох | Эм':'',
                }
            )
        }
    )

    const combo = [
        ...header,
        ...mainData,
    ]

    const worksheet = utils.json_to_sheet(combo);

    const workbook = utils.book_new();
    utils.book_append_sheet(workbook, worksheet, "report")

    const staticCells = [
        'Бүрэлдэхүүн сургууль институт',
        'Хөтөлбөр',
        'Хяналтын тоо/Бүртгүүлсэн',
        '',
        'Насны шаардлага хангасан',
        '',
        '',
        '',
        'Төгссөн мэргэжил шаардлага хангасан эсэх',
        '',
        '',
        '',
        'Дипломын голч дүнгийн шаардлага хангасан эсэх',
        '',
        '',
        '',
        'Хяналтын тоо',
        '',
        'Анхан шатны үзлэг',
        '',
        '',
        '',
        '',
        '',
        'Эрүүл мэндийн үзлэг шинжилгээний дүгнэлт',
        '',
        '',
        '',
        '',
        '',
        'Эрүүгийн хариуцлага хүлээж байсан эсэх шаардлага',
        '',
        '',
        '',
        'Бие бялдрын шалгалт',
        '',
        '',
        '',
        '',
        '',
        'Сэтгэл зүйн сорил, ярилцлага',
        '',
        '',
        '',
        '',
        '',
        'Хувцасны хангалт авсан эсэх',
        '',
        '',
        '',
        'Цэргийн хэргийн анхан шатны бэлтгэл сургалтад хамрагдсан эсэх',
        '',
        '',
        '',
        'Хяналтын тоо/элсүүлэн суралцуулах тушаалд орох',
        '',
        '',
    ];

    const staticCells2 = [
        '',
        '',
        'Эр',
        'Эм',
        'Тийм',
        '',
        'Үгүй',
        '',

        'Тийм',
        '',
        'Үгүй',
        '',

        'Тийм',
        '',
        'Үгүй',
        '',

        '30% хүртэл нэмэгдүүлсэн',
        '',

        'Тэнцсэн',
        '',
        'Тэнцээгүй',
        '',
        'Үзлэгт ороогүй',
        '',

        'Тэнцсэн',
        '',
        'Тэнцээгүй',
        '',
        'Үзлэгт ороогүй',
        '',

        'Хангасан',
        '',
        'Хангаагүй',
        '',

        'Тэнцсэн',
        '',
        'Тэнцээгүй',
        '',
        'Шалгалтад ороогүй',
        '',

        'Тэнцсэн',
        '',
        'Тэнцээгүй',
        '',
        'Сорил, ярилцлагад ороогүй',
        '',

        'Тийм',
        '',
        'Үгүй',
        '',

        'Тийм',
        '',
        'Үгүй',
        '',

        'Эр',
        'Эм',
    ];

    const staticCells3 = [
        '',
        '',
        '',
        '',
        'Эр',
        'Эм',
        'Эр',
        'Эм',
        'Эр',
        'Эм',
        'Эр',
        'Эм',
        'Эр',
        'Эм',
        'Эр',
        'Эм',
        'Эр',
        'Эм',
        'Эр',
        'Эм',
        'Эр',
        'Эм',
        'Эр',
        'Эм',
        'Эр',
        'Эм',
        'Эр',
        'Эм',
        'Эр',
        'Эм',
        'Эр',
        'Эм',
        'Эр',
        'Эм',
        'Эр',
        'Эм',
        'Эр',
        'Эм',
        'Эр',
        'Эм',
        'Эр',
        'Эм',
        'Эр',
        'Эм',
        'Эр',
        'Эм',
        'Эр',
        'Эм',
        'Эр',
        'Эм',
        'Эр',
        'Эм',
        'Эр',
        'Эм',
    ];

    utils.sheet_add_aoa(worksheet, [staticCells], { origin: "A1" });
    utils.sheet_add_aoa(worksheet, [staticCells2], { origin: "A2" });
    utils.sheet_add_aoa(worksheet, [staticCells3], { origin: "A3" });

    const tableHeaderStyle = {
        border: {
            top: { style: "thin", color: { rgb: "000000" } },
            bottom: { style: "thin", color: { rgb: "000000" } },
            left: { style: "thin", color: { rgb: "000000" } },
            right: { style: "thin", color: { rgb: "000000" } }
        },
        font: {
            sz: 10
        },
        alignment: {
            wrapText: true,
            horizontal: 'center',
            vertical: 'center',
        },
        fill: {
            fgColor: {rgb:'fcf1dc'}
        }
    }

    const numberCellStyle = {
        border: {
            top: { style: "thin", color: { rgb: "000000" } },
            bottom: { style: "thin", color: { rgb: "000000" } },
            left: { style: "thin", color: { rgb: "000000" } },
            right: { style: "thin", color: { rgb: "000000" } }
        },
        alignment: {
            horizontal: 'left',
            vertical: 'center',
            wrapText: true
        },
        font:{
            sz:10
        }
    };

    const COLUMN_LENGTH = 55

    // Толгой хэсэгт стайл болон Текст өгж буй хэсэг
    const startRow = 0;
    const endRow = header.length;
    const startCol = 0;
    const endCol = COLUMN_LENGTH;

    for (let row = startRow; row <= endRow; row++) {
        for (let col = startCol; col <= endCol; col++) {
        const cellAddress = utils.encode_cell({ r: row, c: col });

            if (!worksheet[cellAddress]) {
                worksheet[cellAddress] = {};
            }

            worksheet[cellAddress].s = tableHeaderStyle
        }
    }

    const styleRow = endRow + 1;
    const sendRow = endRow + mainData.length + 4;
    const styleCol = 0;
    const sendCol = COLUMN_LENGTH;

    for (let row = styleRow; row <= sendRow; row++) {
        for (let col = styleCol; col <= sendCol; col++) {
        const cellNum = utils.encode_cell({ r: row, c: col });

            if (!worksheet[cellNum]) {
                worksheet[cellNum] = {};
            }

            worksheet[cellNum].s = numberCellStyle;
        }
    }

    // const fRow = sendRow + 1;
    // const fendRow = sendRow + 15;
    // const fCol = 0;
    // const fendCol = COLUMN_LENGTH;

    // for (let row = fRow; row <= fendRow; row++) {
    //     for (let col = fCol; col <= fendCol; col++) {
    //     const cellNum = utils.encode_cell({ r: row, c: col });

    //         if (!worksheet[cellNum]) {
    //             worksheet[cellNum] = {};
    //         }

    //         worksheet[cellNum].s = row === fRow ? footerBorder : textCellStyle
    //         worksheet[cellNum].v = ''
    //     }
    // }


    const colWidth = Array.from({ length: 54 }, (_, idx) => {
        return(
            {
                wch: (idx === 0 || idx === 1 || idx === 52 || idx === 53) ? 10 : 5
            }
        )
    })


    worksheet["!cols"] = [
        {wch: 25},
        {wch: 25},
        ...colWidth
    ];

    worksheet["!rows"] = [
        { hpx: 60 },
        { hpx: 40 },
        { hpx: 20 },
    ];

    worksheet['!merges'] = [
        {
            s: { r: 0, c: 0 },
            e: { r: 2, c: 0 }
        },
        {
            s: { r: 0, c: 1 },
            e: { r: 2, c: 1 }
        },

        // Хяналтын тоо/Бүртгүүлсэн
        {
            s: { r: 0, c: 2 },
            e: { r: 0, c: 3 }
        },
        {
            s: { r: 1, c: 2 },
            e: { r: 2, c: 2 }
        },
        {
            s: { r: 1, c: 3 },
            e: { r: 2, c: 3 }
        },

        // Насны шаардлага хангасан
        {
            s: { r: 0, c: 4 },
            e: { r: 0, c: 7 }
        },
        {
            s: { r: 1, c: 4 },
            e: { r: 1, c: 5 }
        },
        {
            s: { r: 1, c: 6 },
            e: { r: 1, c: 7 }
        },

        // Төгссөн мэргэжил шаардлага хангасан эсэх
        {
            s: { r: 0, c: 8 },
            e: { r: 0, c: 11 }
        },
        {
            s: { r: 1, c: 8 },
            e: { r: 1, c: 9 }
        },
        {
            s: { r: 1, c: 10 },
            e: { r: 1, c: 11 }
        },

        // Дипломын голч дүнгийн шаардлага хангасан эсэх
        {
            s: { r: 0, c: 12 },
            e: { r: 0, c: 15 }
        },
        {
            s: { r: 1, c: 12 },
            e: { r: 1, c: 13 }
        },
        {
            s: { r: 1, c: 14 },
            e: { r: 1, c: 15 }
        },

        // Хяналтын тоо
        {
            s: { r: 0, c: 16 },
            e: { r: 0, c: 17 }
        },
        {
            s: { r: 1, c: 16 },
            e: { r: 1, c: 17 }
        },

        // Анхан шатны үзлэг
        {
            s: { r: 0, c: 18 },
            e: { r: 0, c: 23 }
        },
        {
            s: { r: 1, c: 18 },
            e: { r: 1, c: 19 }
        },
        {
            s: { r: 1, c: 20 },
            e: { r: 1, c: 21 }
        },
        {
            s: { r: 1, c: 22 },
            e: { r: 1, c: 23 }
        },

        // Эрүүл мэндийн үзлэг шинжилгээний дүгнэлт
        {
            s: { r: 0, c: 24 },
            e: { r: 0, c: 29 }
        },
        {
            s: { r: 1, c: 24 },
            e: { r: 1, c: 25 }
        },
        {
            s: { r: 1, c: 26 },
            e: { r: 1, c: 27 }
        },
        {
            s: { r: 1, c: 28 },
            e: { r: 1, c: 29 }
        },

        // Эрүүгийн хариуцлага хүлээжa байсан эсэх шаардлага
        {
            s: { r: 0, c: 30 },
            e: { r: 0, c: 33 }
        },
        {
            s: { r: 1, c: 30 },
            e: { r: 1, c: 31 }
        },
        {
            s: { r: 1, c: 32 },
            e: { r: 1, c: 33 }
        },

        // Бие бялдрын шалгалт
        {
            s: { r: 0, c: 34 },
            e: { r: 0, c: 39 }
        },
        {
            s: { r: 1, c: 34 },
            e: { r: 1, c: 35 }
        },
        {
            s: { r: 1, c: 36 },
            e: { r: 1, c: 37 }
        },
        {
            s: { r: 1, c: 38 },
            e: { r: 1, c: 39 }
        },

        //Сэтгэл зүйн сорил, ярилцлага
        {
            s: { r: 0, c: 40 },
            e: { r: 0, c: 45 }
        },
        {
            s: { r: 1, c: 40 },
            e: { r: 1, c: 41 }
        },
        {
            s: { r: 1, c: 42 },
            e: { r: 1, c: 43 }
        },
        {
            s: { r: 1, c: 44 },
            e: { r: 1, c: 45 }
        },

        //Хувцасны хангалт авсан эсэх
        {
            s: { r: 0, c: 46 },
            e: { r: 0, c: 49 }
        },
        {
            s: { r: 1, c: 46 },
            e: { r: 1, c: 47 }
        },
        {
            s: { r: 1, c: 48 },
            e: { r: 1, c: 49 }
        },

        // Цэргийн хэргийн анхан шатны бэлтгэл сургалтад хамрагдсан эсэх
        {
            s: { r: 0, c: 50 },
            e: { r: 0, c: 53 }
        },
        {
            s: { r: 1, c: 50 },
            e: { r: 1, c: 51 }
        },
        {
            s: { r: 1, c: 52 },
            e: { r: 1, c: 53 }
        },

        // Хяналтын тоо/элсүүлэн суралцуулах тушаалд орох
        {
            s: { r: 0, c: 54 },
            e: { r: 0, c: 55 }
        },
        {
            s: { r: 1, c: 54 },
            e: { r: 2, c: 54 }
        },
        {
            s: { r: 1, c: 55 },
            e: { r: 2, c: 55 }
        },
    ]

    writeFile(workbook, "elseltiin_medeelel.xlsx", { compression: true });

}